from Bot import Bot

SITY = "Первомайский, UA"

BOT_TOKEN = "1939923837:AAGyshv2d9ou7AkTw9oQBNqGlm0PwTpLLgE"

# Answer keys writing only in lowercase!
answers = {
    ("hi", "hello", "privet", "дратути",
    "прив", "привет", "хай", 
    "здравствуйте", "добрый день", "добрый вечер", 
    "доброе утро", "здравствуй", "приветик",): \
    ("hi", "hello", "privet", "дратути",
    "прив", "привет", "хай", 
    "здравствуйте", "добрый день", "добрый вечер", 
    "доброе утро", "здравствуй", "приветик",),

    ("погода", "скажи погоду", "скажи мне погоду", 
    "кинь погоду", "дай погоду", "кинь мне погоду",
    "какая сейчас погода", "какая погода",
    "че по погоде", "че там по погоде", "чё там по погоде",
    "чё по погоде", "как там погода", "как погода",): Bot().GetWeather(sity=SITY)['weather'],
    
    ('температура', 'скажи температуру'): (str(round(Bot().GetWeather(sity=SITY)['temp'])) + '°C'),
    
    ('у тебя попа замерзла', "у тебя попа мерзнет"): 'волк не медведь но попу моет 🐺',
    ('как я тебе сегодня?',): 'у зеркала спроси, у меня доступа к твоей вебке нету',


}

DayNames = {
    "Mon": "понедельник",
    "Tue": "вторник",
    "Wed": "среда",
    "Thu": "четверг",
    "Fri": "пятница",
    "Sat": "суббота",
    "Sun": "воскресенье",
}
